# Exercise 4.1

---

In [5]:
import numpy as np
import pandas as pd

1) Import the `titanic` csv file.

In [2]:
df = pd.read_csv("titanic.csv")

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

2) For every class calculate the average age.

In [7]:
df.groupby("class")["age"].agg(np.mean)

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

3) Are there more women in the first class or men?

In [11]:
df.loc[df["class"] == "First", "sex"].value_counts()

male      122
female     94
Name: sex, dtype: int64

In [12]:
df.groupby("class")["sex"].value_counts()

class   sex
First   male      122
        female     94
Second  male      108
        female     76
Third   male      347
        female    144
Name: sex, dtype: int64

In [16]:
df.groupby("class")["sex"].value_counts()

class   sex
First   male      122
        female     94
Second  male      108
        female     76
Third   male      347
        female    144
Name: sex, dtype: int64

4) Are the passengers that are alone paying more in general or less as compared to the ones that are not alone?

In [18]:
df.groupby("alone")["fare"].agg(np.mean)

alone
False    48.832275
True     21.242689
Name: fare, dtype: float64

5) What was the ticket class of the majority of the people that stayed alive?

In [32]:
ff = df.loc[(df["alive"] == "no") & (df["sex"] == "female")]

In [33]:
ff.groupby(["alive", "sex"])["class"].value_counts()

alive  sex     class
no     female  Third     72
               Second     6
               First      3
Name: class, dtype: int64

---